# Import libraries

In [1]:
import pandas as pd
import numpy as np
import mysql.connector

# Import conector
This didn't work due to problems with the connection with MySQL Server

cnx = mysql.connector.connect (user = "root", password = "Sporting_93", host = '127.0.0.1', database= 'mobility_AML', use_pure = True)

# inicialize cursor

cursor = cnx.cursor ()

# inicialize query

query = ("SELECT * FROM `IV.16_duration`;")

# send query to database
cursor.execute(query)

for i, data in enumerate(cursor):
    duration_df.loc[i] = data

cursor.close()
cnx.close()

# Importing Data and Creating DataFrames
# Duration Table

In [2]:
#import table
duration_df = pd.read_csv("/home/inrx/Ironhack/Projects/Project-Week-2-Lisbon/dataset-lx-transp/IV.16.csv")

In [3]:
# rename column
duration_df = duration_df.rename(columns={"MUN":"Motive", "motor_bike":"motorbike","tax":"taxi"})

In [4]:
# Slice row table for work
work_duration = duration_df[duration_df['Motive'] == 'Work']
work_duration.head()

,Motive,car_driver,car_pass,motorbike,taxi,public_bus,private_bus,train,metro,boat,plane,walk,bike,other
0,Work,24.8,25.5,19.5,22.6,48.3,33.2,51.0,41.4,54.2,262.7,15.1,32.2,56.2

In [5]:
# Slice row table for back home
back_home_duration = duration_df[duration_df['Motive'] =='Back home']

#back_home_duration.head()

In [6]:
# Append work and back home rows on the same table
work_duration = work_duration.append(back_home_duration)
#work_duration.head()

In [7]:
# checking for NaN 
work_duration.isnull().sum()

Motive         0
car_driver     0
car_pass       0
motorbike      0
taxi           0
public_bus     0
private_bus    0
train          0
metro          0
boat           0
plane          0
walk           0
bike           0
other          0
dtype: int64

# Conversion of the minutes in hours.
# This step was droped because the calculation of speed had problems. Probably the dataset has some 
# mistakes

columns_names = list(work_duration.columns[1::])
work_duration[columns_names] = work_duration[columns_names] * 0.0166666667
work_duration.head()

In [8]:
work_duration.describe()

,car_driver,car_pass,motorbike,taxi,public_bus,private_bus,train,metro,boat,plane,walk,bike,other
count,2.000000,2.00000,2.000000,2.000000,2.000000,2.000000,2.000000,2.000000,2.000000,2.000000,2.000000,2.00000,2.000000
mean,23.450000,23.30000,18.950000,20.850000,47.800000,35.200000,52.750000,42.350000,57.550000,249.600000,16.000000,35.90000,44.150000
std,1.909188,3.11127,0.777817,2.474874,0.707107,2.828427,2.474874,1.343503,4.737615,18.526198,1.272792,5.23259,17.041273
min,22.100000,21.10000,18.400000,19.100000,47.300000,33.200000,51.000000,41.400000,54.200000,236.500000,15.100000,32.20000,32.100000
25%,22.775000,22.20000,18.675000,19.975000,47.550000,34.200000,51.875000,41.875000,55.875000,243.050000,15.550000,34.05000,38.125000
50%,23.450000,23.30000,18.950000,20.850000,47.800000,35.200000,52.750000,42.350000,57.550000,249.600000,16.000000,35.90000,44.150000
75%,24.125000,24.40000,19.225000,21.725000,48.050000,36.200000,53.625000,42.825000,59.225000,256.150000,16.450000,37.75000,50.175000
max,24.800000,25.50000,19.500000,22.600000,48.300000,37.200000,54.500000,43.300000,60.900000,262.700000,16.900000,39.60000,56.200000

In [9]:
work_duration = work_duration.drop(columns=['other','taxi','plane'])
work_duration

,Motive,car_driver,car_pass,motorbike,public_bus,private_bus,train,metro,boat,walk,bike
0,Work,24.8,25.5,19.5,48.3,33.2,51.0,41.4,54.2,15.1,32.2
7,Back home,22.1,21.1,18.4,47.3,37.2,54.5,43.3,60.9,16.9,39.6

# Layover Table

In [10]:
layover_df = pd.read_csv ("/home/inrx/Ironhack/Projects/Project-Week-2-Lisbon/dataset-lx-transp/IV.18.csv", \
                          header=None, names=["transport","Total","0","1","> 2","a","b","c","d"])

layover_df.head(10)

     transport       Total           0          1       > 2   a   b   c   d
0   car_driver  2475191.73  2381648.35   88253.78   5289.61 NaN NaN NaN NaN
1     car_pass   697820.74   671130.21   23897.16   2793.38 NaN NaN NaN NaN
2    motorbike    47330.20    46737.23     578.20     14.77 NaN NaN NaN NaN
3         taxi    19219.94    18223.16     958.53     38.26 NaN NaN NaN NaN
4   public_bus   420837.65   232869.94  110466.85  77500.86 NaN NaN NaN NaN
5  private_bus    51387.95    45063.97    4220.71   2103.28 NaN NaN NaN NaN
6        Train   173668.77    30704.62   53929.71  89034.43 NaN NaN NaN NaN
7        metro   166826.93    82242.73   60236.34  24347.85 NaN NaN NaN NaN
8         boat    16564.01     1424.51    3002.83  12136.66 NaN NaN NaN NaN
9         bike    26186.88    24259.93    1874.96     51.99 NaN NaN NaN NaN

In [11]:
layover_df.dtypes

transport     object
Total        float64
0            float64
1            float64
> 2          float64
a            float64
b            float64
c            float64
d            float64
dtype: object

In [12]:
layover_columns = ["a","b","c","d"]
layover_df = layover_df.drop(layover_columns, axis = 1)
layover_df

     transport       Total           0          1       > 2
0   car_driver  2475191.73  2381648.35   88253.78   5289.61
1     car_pass   697820.74   671130.21   23897.16   2793.38
2    motorbike    47330.20    46737.23     578.20     14.77
3         taxi    19219.94    18223.16     958.53     38.26
4   public_bus   420837.65   232869.94  110466.85  77500.86
5  private_bus    51387.95    45063.97    4220.71   2103.28
6        Train   173668.77    30704.62   53929.71  89034.43
7        metro   166826.93    82242.73   60236.34  24347.85
8         boat    16564.01     1424.51    3002.83  12136.66
9         bike    26186.88    24259.93    1874.96     51.99

In [13]:
# Finding the relative values per row for each column

layover_df["0"]=layover_df["0"]*100/layover_df["Total"] 
layover_df["1"]=layover_df["1"]*100/layover_df["Total"] 
layover_df["> 2"]=layover_df["> 2"]*100/layover_df["Total"]
layover_df["Total"]=layover_df["Total"]*100/layover_df["Total"]
layover_df.head(10)

     transport  Total          0          1        > 2
0   car_driver  100.0  96.220762   3.565533   0.213705
1     car_pass  100.0  96.175160   3.424541   0.400301
2    motorbike  100.0  98.747164   1.221630   0.031206
3         taxi  100.0  94.813824   4.987164   0.199064
4   public_bus  100.0  55.334864  26.249279  18.415857
5  private_bus  100.0  87.693652   8.213424   4.092944
6        Train  100.0  17.679989  31.053200  51.266805
7        metro  100.0  49.298234  36.107084  14.594676
8         boat  100.0   8.600031  18.128642  73.271267
9         bike  100.0  92.641544   7.159921   0.198535

In [86]:
# find the max layovers row in the "> 2" column
max_layovers = layover_df["> 2"].max()

# Find the mode of transportation with max layovers
max_layovers_row = layover_df.loc[layover_df['> 2'] == max_layovers].index.item()


## Then, given the index, we find the transport of the corresponding index
max_layovers_transport = layover_df.loc[max_layovers_row,'transport']

max_layovers_transport = max_layovers_transport.lower()

print (f'The mode of transport with more layovers is {max_layovers_transport}, \
with {round(max_layovers,2)} % of total people who commute by {max_layovers_transport} \
doing more than 2 layovers.')

The mode of transport with more layovers is boat, with 73.27 % of total people who commute by boat doing more than 2 layovers.

In [15]:
min_layovers = layover_df["0"].max()

# Find the mode of transportation with max layovers
min_layovers_row = layover_df.loc[layover_df['0'] == min_layovers].index.item()

## Then, given the index, we find the transport of the corresponding index
min_layovers_transport = layover_df.loc[min_layovers_row,'transport']

min_layovers_transport = min_layovers_transport.lower()

print (f'The mode of transport with fewer layovers is {min_layovers_transport}, \
with {round(min_layovers,2)} % of total people who commute by {min_layovers_transport} \
not doing layovers.')

The mode of transport with fewer layovers is motorbike, with 98.75 % of total people who commute by motorbike not doing layovers.

# Is there a correlation between commute duration and the number of layovers?

In order to determine the mode of transportation with max and min durations we decided to transpose the DataFrame.

In [16]:
work_duration_t=work_duration.transpose()
work_duration_t

                0          7
Motive       Work  Back home
car_driver   24.8       22.1
car_pass     25.5       21.1
motorbike    19.5       18.4
public_bus   48.3       47.3
private_bus  33.2       37.2
train          51       54.5
metro        41.4       43.3
boat         54.2       60.9
walk         15.1       16.9
bike         32.2       39.6

work_duration_t.rename(columns={"0": "work","7":"back home"}, inplace=True)
work_duration_t

In [17]:
# After transposing the DataFrame we had to rename the columns with the correct name. This was done by 
# using the "rename" command to set the columns names has the first row (DataFrame.iloc[0])

work_duration_t = work_duration_t.rename(columns=work_duration_t.iloc[0])

In [18]:
# Afterwards we had to drop the row with the first row of the DataFrame

work_duration_t = work_duration_t.drop("Motive", axis=0)
work_duration_t

             Work Back home
car_driver   24.8      22.1
car_pass     25.5      21.1
motorbike    19.5      18.4
public_bus   48.3      47.3
private_bus  33.2      37.2
train          51      54.5
metro        41.4      43.3
boat         54.2      60.9
walk         15.1      16.9
bike         32.2      39.6

In [19]:
# Since we were comparing layovers and duration of commute, and since walking doesn't involve
# layovers, we decided to drop the walk row. 

work_duration_t_no_walk = work_duration_t.drop("walk", axis=0)
work_duration_t_no_walk

             Work Back home
car_driver   24.8      22.1
car_pass     25.5      21.1
motorbike    19.5      18.4
public_bus   48.3      47.3
private_bus  33.2      37.2
train          51      54.5
metro        41.4      43.3
boat         54.2      60.9
bike         32.2      39.6

Now, we find the modes of transportation with maximum and minimum duration

In [20]:
max_duration = work_duration_t["Work"].max()

# Find the mode of transportation with max duration
max_duration_row = work_duration_t.loc[work_duration_t['Work'] == max_duration].index.item()

#max_duration_transport = max_duration_transport.lower()

print (f'The mode of transport that takes longer is {max_duration_row}, \
consuming about {max_duration} min daily.')

The mode of transport that takes longer is boat, consuming about 54.2 min daily.

In [21]:
min_duration = work_duration_t_no_walk["Work"].min()

min_duration_row = work_duration_t_no_walk.loc[work_duration_t_no_walk['Work'] == min_duration].index.item()

print (f'The quickest mode of transport is {min_duration_row}, \
consuming about {min_duration} min daily.')

The quickest mode of transport is motorbike, consuming about 19.5 min daily.

# Answer to the question
Answering to the question we made previously, we defined a if statment that prints a message.

In [36]:
if max_layovers_transport == max_duration_row and min_layovers_transport == min_duration_row:
    print (f'The number of layovers influences the commute duration.\n\
In terms of confort, {min_layovers_transport} is the trasportation with less layovers, thus, \
more confortable for daily use. It is the fastest mode of transportation, as well. \
By the other end, {max_layovers_transport} is the slowest mode of transportation in the Lisbon Metro Area.\
and the one that forces to make more layovers.')
    
else:
    print (f"there is no relationship between the number of layovers and commute duration")

The number of layovers influences the commute duration.
In terms of confort, motorbike is the trasportation with less layovers, thus, more confortable for daily use. It is the fastest mode of transportation, as well. By the other end, boat is the slowest mode of transportation in the Lisbon Metro Area.and the one that forces to make more layovers.

# Distance Table

In [23]:
#import
distance_df = pd.read_csv ("/home/inrx/Ironhack/Projects/Project-Week-2-Lisbon/dataset-lx-transp/IV.17.csv")

distance_df.head()

,Motive,car_driver,car_pass,motorbike,t√°x,public_bus,private_bus,train,metro,boat,plaine,walk,bike,other
0,Work,14.7,15.8,13.3,9.4,12.5,23.4,18.5,8.9,19.0,906.0,1.4,8.0,38.8
1,Study,14.1,5.7,10.1,8.3,10.7,7.1,20.1,7.5,20.6,NaN,1.5,7.5,59.1
2,Accompany,7.5,10.0,7.6,4.7,8.6,9.4,16.0,7.1,18.4,NaN,1.3,0.9,13.3
3,Recreaton,19.0,20.7,13.2,6.6,19.0,33.1,13.6,5.7,16.1,519.1,2.0,9.2,46.1
4,Shopping,7.7,10.6,7.9,3.9,6.7,5.0,15.5,6.6,6.6,NaN,1.4,8.9,14.0

In [24]:
distance_df = distance_df.drop(columns=['plaine','other','t√°x'])
distance_df

,Motive,car_driver,car_pass,motorbike,public_bus,private_bus,train,metro,boat,walk,bike
0,Work,14.7,15.8,13.3,12.5,23.4,18.5,8.9,19.0,1.4,8.0
1,Study,14.1,5.7,10.1,10.7,7.1,20.1,7.5,20.6,1.5,7.5
2,Accompany,7.5,10.0,7.6,8.6,9.4,16.0,7.1,18.4,1.3,0.9
3,Recreaton,19.0,20.7,13.2,19.0,33.1,13.6,5.7,16.1,2.0,9.2
4,Shopping,7.7,10.6,7.9,6.7,5.0,15.5,6.6,6.6,1.4,8.9
5,Personal matters,19.6,20.1,9.3,17.3,14.8,26.6,6.7,22.6,1.5,11.8
6,other,17.5,15.4,4.1,17.2,4.0,17.7,7.6,NaN,1.2,9.0
7,Back home,13.0,13.8,12.1,11.3,18.0,18.8,9.5,20.2,1.4,9.5

In [25]:
work_distance = distance_df[distance_df['Motive'] == 'Work']
back_home_distance = distance_df[distance_df['Motive'] =='Back home']
work_distance = work_distance.append(back_home_distance)
work_distance.head()

,Motive,car_driver,car_pass,motorbike,public_bus,private_bus,train,metro,boat,walk,bike
0,Work,14.7,15.8,13.3,12.5,23.4,18.5,8.9,19.0,1.4,8.0
7,Back home,13.0,13.8,12.1,11.3,18.0,18.8,9.5,20.2,1.4,9.5

In [26]:
work_distance.describe()

,car_driver,car_pass,motorbike,public_bus,private_bus,train,metro,boat,walk,bike
count,2.000000,2.000000,2.000000,2.000000,2.000000,2.000000,2.000000,2.000000,2.0,2.00000
mean,13.850000,14.800000,12.700000,11.900000,20.700000,18.650000,9.200000,19.600000,1.4,8.75000
std,1.202082,1.414214,0.848528,0.848528,3.818377,0.212132,0.424264,0.848528,0.0,1.06066
min,13.000000,13.800000,12.100000,11.300000,18.000000,18.500000,8.900000,19.000000,1.4,8.00000
25%,13.425000,14.300000,12.400000,11.600000,19.350000,18.575000,9.050000,19.300000,1.4,8.37500
50%,13.850000,14.800000,12.700000,11.900000,20.700000,18.650000,9.200000,19.600000,1.4,8.75000
75%,14.275000,15.300000,13.000000,12.200000,22.050000,18.725000,9.350000,19.900000,1.4,9.12500
max,14.700000,15.800000,13.300000,12.500000,23.400000,18.800000,9.500000,20.200000,1.4,9.50000

In [41]:
work_distance_t = work_distance.transpose()
work_distance_t

                0          7
Motive       Work  Back home
car_driver   14.7         13
car_pass     15.8       13.8
motorbike    13.3       12.1
public_bus   12.5       11.3
private_bus  23.4         18
train        18.5       18.8
metro         8.9        9.5
boat           19       20.2
walk          1.4        1.4
bike            8        9.5

In [43]:
# After transposing the DataFrame we had to rename the columns with the correct name. This was done by 
# using the "rename" command to set the columns names has the first row (DataFrame.iloc[0])

work_distance_t = work_distance_t.rename(columns=work_distance_t.iloc[0])
work_distance_t

             Work  Back home
Motive       Work  Back home
car_driver   14.7         13
car_pass     15.8       13.8
motorbike    13.3       12.1
public_bus   12.5       11.3
private_bus  23.4         18
train        18.5       18.8
metro         8.9        9.5
boat           19       20.2
walk          1.4        1.4
bike            8        9.5

In [44]:
# Afterwards we had to drop the row with the first row of the DataFrame

work_distance_t = work_distance_t.drop("Motive", axis=0)
work_distance_t

             Work Back home
car_driver   14.7        13
car_pass     15.8      13.8
motorbike    13.3      12.1
public_bus   12.5      11.3
private_bus  23.4        18
train        18.5      18.8
metro         8.9       9.5
boat           19      20.2
walk          1.4       1.4
bike            8       9.5

In [48]:
max_distance = work_distance_t["Work"].max()

# Find the mode of transportation with max duration
max_distance_row = work_distance_t.loc[work_distance_t['Work'] == max_distance].index.item()

#max_duration_transport = max_duration_transport.lower()

print (f'The mode of transport that makes longer distances is {max_distance_row}, \
traveling {max_distance} km daily.')

The mode of transport that makes longer distances is private_bus, traveling 23.4 km daily.

In [51]:
work_distance_t = work_distance_t.drop("walk", axis=0)
work_distance_t

             Work Back home
car_driver   14.7        13
car_pass     15.8      13.8
motorbike    13.3      12.1
public_bus   12.5      11.3
private_bus  23.4        18
train        18.5      18.8
metro         8.9       9.5
boat           19      20.2
bike            8       9.5

In [52]:
min_distance = work_distance_t["Work"].min()

# Find the mode of transportation with max duration
min_distance_row = work_distance_t.loc[work_distance_t['Work'] == min_distance].index.item()

#max_duration_transport = max_duration_transport.lower()

print (f'The mode of transport that makes smaller distances is {min_distance_row}, \
traveling {min_distance} km daily.')

The mode of transport that makes longer distances is bike, traveling 8.0 km daily.

In [90]:
layover_df

     transport  Total          0          1        > 2
0   car_driver  100.0  96.220762   3.565533   0.213705
1     car_pass  100.0  96.175160   3.424541   0.400301
2    motorbike  100.0  98.747164   1.221630   0.031206
3         taxi  100.0  94.813824   4.987164   0.199064
4   public_bus  100.0  55.334864  26.249279  18.415857
5  private_bus  100.0  87.693652   8.213424   4.092944
6        Train  100.0  17.679989  31.053200  51.266805
7        metro  100.0  49.298234  36.107084  14.594676
8         boat  100.0   8.600031  18.128642  73.271267
9         bike  100.0  92.641544   7.159921   0.198535

In [95]:
# Find the duration of the  transport with the min distance
min_distance_duration = work_duration_t["Work"][min_distance_row]
print (min_distance_row)

# Find the index of the min duration transport in layovers DataFrame
min_distance_layovers_row = layover_df.loc[layover_df['transport'] == min_distance_row].index.item()
print (max_layovers_row)




## Then, given the index, we find the transport of the corresponding index
min_distance_layovers_0 = layover_df.loc[min_distance_layovers_row,'0']
print (min_distance_layovers_0)
min_distance_layovers_1 = layover_df.loc[min_distance_layovers_row,'1']
print (min_distance_layovers_1)
min_distance_layovers_2 = layover_df.loc[min_distance_layovers_row,'> 2']
print (min_distance_layovers_2)


#converting the distance (in minutes) to hours
min_distance_duration = min_distance_duration / 60

# Calculating average speed
avg_speed = min_distance/min_distance_duration


print (f'{min_distance_row.title()} has a average speed of {round(avg_speed,2)} km/h')

bike
9
92.64154416257301
7.159921304103428
0.19853453332355744
Bike has a average speed of 14.91 km/h

In [69]:
bus_duration = 48/60
max_distance/bus_duration

29.249999999999996

# Calculating Speed

velocity_df = pd.DataFrame ()
velocity_df.head()

velocity_df['Motive'] = work_distance["Motive"]
velocity_df.head()

velocity_df['car_driver'] = work_distance["car_driver"] / work_duration["car_driver"]
velocity_df

In [27]:
velocity_df = work_distance.copy()
velocity_df

,Motive,car_driver,car_pass,motorbike,public_bus,private_bus,train,metro,boat,walk,bike
0,Work,14.7,15.8,13.3,12.5,23.4,18.5,8.9,19.0,1.4,8.0
7,Back home,13.0,13.8,12.1,11.3,18.0,18.8,9.5,20.2,1.4,9.5

work_distance[columns_names] / 3600

work_duration

19.5 / 0.005417

# Calculations

In [28]:
layover_df["0"].max()

98.74716354462902

In [29]:
layover_df["1"].max()

36.10708415002302

# Conclusions